/**
 * Created by alex on 30.12.14.
 */
var angApp = angular.module('angApp', ['ui.bootstrap']);

angApp.controller('angCtrl', function($scope){
    $scope.mockData =
        [
            ["Брынза из коровьего молока",17.9,20.1,0.0,260, "Молоко и молочное"],
            ["Йогурт натуральный 1.5% жирности",5.0,1.5,3.5,51,"Молоко и молочное"],
            ["Кефир нежирный",3,0.1,3.8,30, "Молоко и молочное"],
            ["Кефир жирный",2.8,3.2,4.1,59, "Молоко и молочное"],
            ["Молоко",2.8,3.2,4.7,58, "Молоко и молочное"],
            ["Молоко ацидофильное",2.8,3.2,10.8,83, "Молоко и молочное"],
            ["Молоко сухое цельное",25.6,25,39.4,475, "Молоко и молочное"],
            ["Молоко сгущеное",7,7.9,9.5,135, "Молоко и молочное"],
            ["Молоко сгущеное с сахаром",7.2,8.5,56,315, "Молоко и молочное"],
            ["Простокваша",2.8,3.2,4.1,58, "Молоко и молочное"],
            ["Ряженка",3,6,4.1,85, "Молоко и молочное"],
            ["Сливки 10%",3,10,4,118, "Молоко и молочное"],
            ["Сливки 20%",2.8,20,3.6,205, "Молоко и молочное"],
            ["Сметана 10%",3,10,2.9,116, "Молоко и молочное"],
            ["Сметана 20%",2.8,20,3.2,206, "Молоко и молочное"],
            ["Сырки и масса творожные особые",7.1,23,27.5,340, "Молоко и молочное"],
            ["Сыр российский",23.4,30,0,371, "Молоко и молочное"],
            ["Сыр голландский",26.8,27.3,0,361, "Молоко и молочное"],
            ["Сыр швейцарский",24.9,31.8,0,396, "Молоко и молочное"],
            ["Сыр пошехонский",26,26.5,0,334, "Молоко и молочное"],
            ["Сыр плавленный",24,13.5,0,226, "Молоко и молочное"],
            ["Творог жирный",14,18,1.3,226, "Молоко и молочное"],
            ["Творог полужирный",16.7,9,1.3,156, "Молоко и молочное"],
            ["Творог нежирный",18,0.6,1.5,86, "Молоко и молочное"]
        ];

    $scope.currentPage = 1;
    $scope.offset = 1;
    $scope.step = 10;
    $scope.totalItems = $scope.mockData.length;

    $scope.pagedData = $scope.mockData.slice(($scope.currentPage * $scope.offset)-1, $scope.offset + $scope.step - 1);

    $scope.pageChanged = function() {
        console.log('Page changed to: ' + $scope.currentPage);
        $scope.pagedData = $scope.mockData.slice(($scope.currentPage * $scope.offset)-1, $scope.offset + $scope.step - 1);
        $scope.offset = (($scope.currentPage * $scope.offset)-1)
    };

});
